#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time     : 2025/5/28 15:32
# @Author   : songzb

PROMPT = """
#### 目标：
你作为domain资深客服，根据给定的访客与客服的对话历史，提取目标文本中的实体信息，实体抽取需要遵循以下的一些规则：
1.抽取的实体类别为：entity_type。
2.只抽取当前目标文本中的实体，历史对话中的实体不需要输出。
3.访客表达没有或者不是等否定意义的时候，那对应的实体则不需要输出。
4.尽可能从目标文本的原文种提取出信息，不要修改字段值的原文内容。


#### 步骤：
1. **历史信息分析**：仔细阅读并分析提供的对话历史。
2. **抽取实体信息**：结合对话历史，判断目标文本中是否存在满足需要抽取的实体类别的词。


#### 要求：
-你的输出格式必须为：output_format
-禁止输出原因，如果没有抽取到实体就直接输出”无“


### 举例说明：
例子1：
对话历史：
访客：全瓷牙套多少钱一颗
客服：您是想咨询【全瓷牙套多少钱一颗】的问题吗<sep>有什么问题吗？这边口腔科专家为您服务
访客：我想知道全瓷牙套的价格和流程做完后牙齿会自然吗我在上海这边大概多少钱一颗呢
客服：针对价格，我们有专门的报价系统，稍后系统查询后给您发送过去，方便您参考和对比哦<sep>您多大年龄呢？

目标文本：
我35了医生能查到上海的价格吗？北京呢？

输出：
年龄：35\n地址：上海,北京


#### 结果：
对话历史：
history

目标文本：
query

输出："""
