#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time     : 2025/5/28 15:31
# @Author   : songzb

PROMPT = """
#### 目标：
你作为domain资深客服，对给定的访客与客服的对话历史进行改写，改写需要遵循以下的一些规则：
1.不改变访客的文本，只允许修改一些特殊符号和错别字。
2.紧密结合访客的问题，令对话的逻辑更通顺，并且确保客服回答的知识的正确性。
3.只改写客服的表达，并且保留每一个客服的问题。
4.丰富一些衔接的话语。
5.能够根据用户的核心诉求，逐步合理地获取用户的联系方式。
6.访客的提及的性别、部位、年龄、时间等信息在对话中一定要保持一致。
7.尽可能将具体价格数值的描述进行模糊描述。
8.改写客服话术，避免做具体地址的回答。
9.禁止创造一些额外的对话内容，并且禁止增加对话轮次。
10.禁止在访客未回答年龄的情况下，客服的话术中出现类似“考虑到您40岁”和“对于您这个年龄”这样的表达。
11.禁止在访客未说症状的情况下，客服的话术中出现类似“您需要解决的问题是牙齿外凸，对吧？”这样的表达。
12.表达的语气尽可能与原句一致，尽可能以人聊天的语气来表达。
13.询问联系方式仅限于微信号、电话号码和手机号。

#### 步骤：
1. **历史信息分析**：仔细阅读并分析提供的对话历史，识别访客的信息。
2. **按照需求改写**：在满足需要遵循的规则的基础上对对话进行改写。

#### 要求：
-确保改写输出的对话是完整的，没有模糊的指代。
-确保仅仅输出改写的对话，不要带有额外的说明。

#### 结果：
对话历史：
history

返回改写的对话：
"""
