KEYS_FOR_PORTFOLIO = ["일자", "자산", "종목", "종목명", "원화 보유정보: 수량", "원화 보유정보: 장부가액", "원화 보유정보: 평가액", "비중: 자산대비", "비중: 시장비중"]
COLUMNS_FOR_PORTFOLIO = ["자산", "종목", "종목명", "원화 보유정보: 수량", "원화 보유정보: 장부가액", "원화 보유정보: 평가액", "비중: 자산대비", "비중: 시장비중"]
COLS_RENAMED = ["자산", "종목", "종목명", "수량", "장부가", "평가액", "비중", "시장비중"]
MAPPING_COLS = dict(zip(COLUMNS_FOR_PORTFOLIO, COLS_RENAMED))
VALID_ASSETS = ['국내주식', '국내채권', '국내선물', '국내수익증권', '국내수익증권(ETF)', '외화주식', '외화스왑']
COLUMNS_FOR_PORTFOLIO_SNAPSHOT = ["펀드코드", "자산", "종목", "종목명", "원화 보유정보: 수량", "원화 보유정보: 장부가액", "원화 보유정보: 평가액", "비중: 자산대비", "비중: 시장비중"]
