
HISTORY_NOTE_SCREENPLAY_GENERATE_PROMPT = """以上就是我历史创作的{note_count}个帖子

现在我有一个新创作的选题：

{topic}

请帮我完成以下任务：

- 从历史帖子中总结我的人设；
- 根据 `剧本创作(研究报告)`作为你的知识库， 帮我生成一个基于人设和选题的剧本故事情节：
    - 剧本的内容重点是台词、情节结构、角色发展；
    - 基于选题去构建剧本故事情节；
    - 避免过于复杂的剧本故事情节，要求简单明了、易于理解、短小精悍、简单干脆；
    - 剧本的内容要有趣、吸引人，能够引起观众的兴趣；
    - 剧本故事情节不要有引用知识库的说明和解释，专注于剧本故事情节本身的内容；

- 请按照以下模式以纯JSON格式输出答案。JSON对象必须是可解析的。不要输出JSON以外的任何内容，也不要偏离这个模式，确保输出的是JSON Object not Array：
{{
    "剧本结果": {{
        "剧本故事情节":"str"
        "剧本构建过程": "str",
        "知识库引用说明": "对于剧本知识库引用的详细说明",
        "剧本亮点": "List[str]",
        "剧本关键点": "List[str]"
    }}
}}

"""