vowel_letters = ["அ","ஆ","இ","ஈ","உ","ஊ","எ","ஏ","ஐ","ஒ","ஓ","ஔ"]
VOULES_SYM = ["ா", "ி", "ீ", "ு", "ூ", "ெ", "ே", "ை", "ொ", "ோ", "ௌ" ]
EXACT_VOULE = ["அ","ஆ","இ","ஈ","உ","ஊ","எ","ஏ","ஐ","ஒ","ஓ","ஔ"]
EXACT_CONSTANT =["க","ங","ச","ஞ","ட","ண","த","ந","ப","ம","ய","ர","ல","வ","ழ","ள","ற","ன"]
UTF_VOULE = ['்',  "ா", "ி", "ீ", "ு", "ூ", "ெ", "ே", "ை", "ொ", "ோ", "ௌ" ]
AUTHAM = "ஃ"
#sanskrit__letters = ["ஶ", "ஜ", "ஷ", "ஸ", "ஹ", "க்ஷ"]
sanskrit_consonents_letters = ["ஶ்", "ஜ்", "ஷ்", "ஸ்", "ஹ்", "க்ஷ்"]
tamil_numerals = ["௦", "௧", "௨", "௩", "௪", "௫", "௬", "௭", "௮", "௯", "௰""௱","௲"]
tamil_sym=["௳","௴","௵","௶","௷","௹","௺"]

HARD_CONSTAND = ["க்","ச்","ட்","த்","ப்","ற்"]
SOFT_CONSTANT = ["ங்","ஞ்","ண்","ந்", "ம்","ன்"]
